cask_args appdir: "/Applications"

tap "aws/tap"

brew "aws-shell"
brew "gawk"
brew "gnu-sed"
brew "findutils"
brew "github/gh/gh"
brew "git"
brew "goenv", args:['HEAD']
brew "jenv"
brew "jq"
brew "mysql-client"
brew "nkf"
brew "openssl"
brew "pyenv"
brew "rbenv"
brew "tree"
brew "yarn"
brew "zsh"
brew "zsh-completion"
brew "golang-migrate"
brew "aws-sam-cli"
brew "jo"

cask "sequel-pro"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "shiftit"
cask "authy"
cask "clipy"
cask "mysqlworkbench"
cask "spotify"
cask "visual-studio-code"
cask "slack"
cask "flux"
cask "authy"

mas "Be Focused", id: 973134470
mas "Mini Calendar", id: 1088779979 
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "CotEditor", id: 1024640650
