cask_args appdir: "/Applications"

brew "aws-shell"
brew "gawk"
brew "gh"
brew "git"
brew "goenv"
brew "jenv"
brew "jq"
brew "mysql-client"
brew "nkf"
brew "openssl"
brew "pyenv"
brew "rbenv"
brew "tree"
brew "yarn"
brew "zsh"
brew "zsh-completion"

cask "sequel-pro"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "item2"
cask "karabiner-elements"
cask "shiftit"
cask "authy"
cask "clipy"
cask "mysqlworkbench"
cask "spotify"
cask "visual-studio-code"

mas "Be Focused", id: 973134470
mas "Mini Calendar", id: 1088779979 
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
